#+BEGIN_EXPORT html
---
layout: post
title: Debian 9 post-installation
tagline: " arrangement automation"
permalink: /debian/post-installation.html
categories: [Debian, DevEnv]
tags: [post-installation, arrangement, automation]
---
#+END_EXPORT

#+STARTUP: showall
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export

** Docker

   Initial source is an official ~Docker~ [[https://docs.docker.com/engine/installation/linux/docker-ce/debian/][site]]

   #+BEGIN_EXAMPLE
     # apt-get remove docker docker-engine docker.io
     # apt-get update
     # apt-get install apt-transport-https /
       ca-certificates curl gnupg2 software-properties-common
     # curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -
     # apt-key fingerprint 0EBFCD88
     # add-apt-repository    "deb [arch=amd64] https://download.docker.com/linux/debian \
			      $(lsb_release -cs) \
			      stable"
     # apt-get update
     # apt-get install docker-ce
   #+END_EXAMPLE

   #+BEGIN_SRC sh
   docker --version
   #+END_SRC

   #+RESULTS:
   : Docker version 17.06.0-ce, build 02c1d87

   Post-installation [[https://docs.docker.com/engine/installation/linux/linux-postinstall/][procedures]]

** Check the existing folders

   As I'm expect to store my data locally and I'm a =user= in generic
   sense of this word, lets check-up =/usr/local/= directory as a
   potential storage for my data.

   
   #+BEGIN_SRC sh
   tree -L 1 /usr/local/
   #+END_SRC

   #+RESULTS:
   #+begin_example
   /usr/local/
   ├── bin
   ├── etc
   ├── games
   ├── include
   ├── lib
   ├── man -> share/man
   ├── sbin
   ├── share
   └── src

   9 directories, 0 files
#+end_example

   #+BEGIN_SRC sh
   tree -L 2 /usr/local/lib/
   #+END_SRC

   #+RESULTS:
   : /usr/local/lib/
   : ├── python2.7
   : │   ├── dist-packages
   : │   └── site-packages
   : └── python3.5
   :     └── dist-packages
   : 
   : 5 directories, 0 files

   #+BEGIN_SRC sh
   tree -L 2 /usr/local/share/
   #+END_SRC

   #+RESULTS:
   #+begin_example
   /usr/local/share/
   ├── anki
   │   ├── anki.xml
   │   ├── bin
   │   ├── Makefile
   │   └── README
   ├── applications
   │   ├── anki.desktop
   │   └── mimeinfo.cache
   ├── ca-certificates
   ├── emacs
   │   ├── 25.1
   │   └── site-lisp
   ├── fonts
   ├── man
   │   └── man1
   ├── pixmaps
   │   ├── anki.png
   │   └── anki.xpm
   ├── sgml
   │   ├── declaration
   │   ├── dtd
   │   ├── entities
   │   ├── misc
   │   └── stylesheet
   └── xml
       ├── declaration
       ├── entities
       ├── misc
       └── schema

   22 directories, 5 files
#+end_example

** Check-up user groups

   By default convention the user don't allowed to write into
   =/usr/local/=, [[https://wiki.debian.org/SystemGroups][but]] staff group is a special case:
   
   #+BEGIN_QUOTE
   staff: Allows users to add local modifications to the system
   (/usr/local) without needing root privileges...
   #+END_QUOTE

   Initially it is an empty group, there are no users in it:

   #+BEGIN_SRC sh
   groups | grep staff
   echo "---"
   groups alioth | grep staff
   #+END_SRC

   #+RESULTS:
   : ---

*** And check groups now:
   
    #+BEGIN_SRC sh
    groups | grep staff
    echo "==="
    groups alioth | grep staff
    #+END_SRC

    #+RESULTS:
    : alioth cdrom floppy sudo audio dip video plugdev staff netdev bluetooth scanner
    : ===
    : alioth : alioth cdrom floppy sudo audio dip video plugdev staff netdev bluetooth scanner

*** Testing

    Is it possible to touch file in ~/usr/local/share/~ right now?
   
    #+BEGIN_SRC sh
    cd /usr/local/share/
    touch test.file.txt
    ls -la | grep test
    rm test.file.txt
    echo "++++"
    ls -la | grep test
    #+END_SRC

    #+RESULTS:
    : -rw-r--r--  1 alioth staff     0 Aug  2 18:39 test.file.txt
    : ++++

*** Target directory overview

    #+BEGIN_SRC sh
    ls -la /usr/local/
    ls -la /usr/local/lib/
    ls -la /usr/local/share/
    # mkdir books courses
    #+END_SRC

    #+RESULTS:
    #+begin_example
    total 44
    drwxrwsr-x 11 root   staff 4096 Aug 25 09:39 .
    drwxr-xr-x 11 root   root  4096 Aug 15 03:54 ..
    drwxrwsr-x  2 root   staff 4096 Aug  2 19:24 bin
    drwxrwsr-x  2 root   staff 4096 Jul 23 06:13 etc
    drwxrwsr-x  2 root   staff 4096 Jul 23 06:13 games
    drwxr-sr-x  5 alioth staff 4096 Aug  5 16:37 git
    drwxrwsr-x  2 root   staff 4096 Jul 23 06:13 include
    drwxrwsr-x  4 root   staff 4096 Jul 31 20:19 lib
    lrwxrwxrwx  1 root   staff    9 Jul 31 20:19 man -> share/man
    drwxrwsr-x  2 root   staff 4096 Jul 23 06:13 sbin
    drwxrwsr-x 12 root   staff 4096 Aug  3 19:22 share
    drwxrwsr-x  2 root   staff 4096 Jul 23 06:13 src
    total 16
    drwxrwsr-x  4 root staff 4096 Jul 31 20:19 .
    drwxrwsr-x 11 root staff 4096 Aug 25 09:39 ..
    drwxrwsr-x  4 root staff 4096 Jul 31 20:19 python2.7
    drwxrwsr-x  3 root staff 4096 Jul 31 20:19 python3.5
    total 48
    drwxrwsr-x 12 root   staff 4096 Aug  3 19:22 .
    drwxrwsr-x 11 root   staff 4096 Aug 25 09:39 ..
    drwxr-sr-x  3 root   staff 4096 Aug  2 19:24 anki
    drwxr-sr-x  2 root   staff 4096 Aug 17 16:09 applications
    drwxr-sr-x  4 alioth staff 4096 Aug  3 19:24 arch
    drwxrwsr-x  2 root   staff 4096 Jul 23 06:20 ca-certificates
    drwxrwsr-x  4 root   staff 4096 Aug  2 19:23 emacs
    drwxrwsr-x  2 root   staff 4096 Jul 23 06:20 fonts
    drwxrwsr-x  3 root   staff 4096 Aug  2 19:24 man
    drwxr-sr-x  2 root   staff 4096 Aug  2 19:24 pixmaps
    drwxrwsr-x  7 root   staff 4096 Jul 31 20:19 sgml
    drwxrwsr-x  6 root   staff 4096 Jul 31 20:19 xml
 #+end_example

** Cloning repositories

   Exactly for clarity purpose it would be useful to utilize
   =folder per user= schema, with inner repositories allocation.
   
   #+BEGIN_SRC sh
   mkdir /usr/local/git/0--key/
   cd /usr/local/git/0--key/
   git clone https://github.com/0--key/lib.git
   git clone https://github.com/0--key/org-pub.git
   git clone https://github.com/0--key/0--key.github.io.git
   #+END_SRC

   as a result you should get something around this:

   #+BEGIN_SRC sh
   tree -L 2 /usr/local/git/
   #+END_SRC

   #+RESULTS:
   #+begin_example
   /usr/local/git/
   ├── 0--key
   │   ├── 0--key.github.io
   │   ├── lib
   │   ├── nltk
   │   ├── org-pub
       └── talk-python-transcripts

   #+end_example
  
** Virtual Environment

   Is a cool feature to use in daily work /for each developer/. Thus it
   is necessary to assign a _semantically_ pertinent path to allocate
   all theirs ~venvs~ in some particular folder:

   #+BEGIN_SRC sh
   mkdir -p /usr/local/share/DVCS/alioth
   mkdir -p /usr/local/share/DVCS/vikky
   #+END_SRC

   #+RESULTS:

   E.g. two our users would place the individual version of ~venvs~ in
   separate folders.

   Suppose you're alerady installed ~virtualenv~ on your system. Thus:

   #+BEGIN_SRC sh
   python --version
   virtualenv -p /usr/bin/python3 /usr/local/share/DVCS/alioth/venv3
   #+END_SRC

   #+RESULTS:
   : Python 2.7.13
   : Already using interpreter /usr/bin/python3
   : Using base prefix '/usr'
   : New python executable in /usr/local/share/DVCS/alioth/venv3/bin/python3
   : Also creating executable in /usr/local/share/DVCS/alioth/venv3/bin/python
   : Installing setuptools, pkg_resources, pip, wheel...done.

   Try to overview your venv:

   #+BEGIN_SRC sh
   tree -L 1 /usr/local/share/DVCS/alioth/venv3/
   #+END_SRC

   #+RESULTS:
   : /usr/local/share/DVCS/alioth/venv3/
   : ├── bin
   : ├── lib
   : └── share
   : 
   : 3 directories, 0 files
* Grammar

  The main target is in creation of grammatically correct textes, even
  though /Emacs/ has an advanced grammar-checker, lets extend it
  ability by external plug-in.

  #+BEGIN_SRC sh
  java -version
  ls -la /usr/local/java/
  #+END_SRC

  #+RESULTS:
  : openjdk version "1.8.0_151"
  : OpenJDK Runtime Environment (build 1.8.0_151-8u151-b12-1~deb9u1-b12)
  : OpenJDK 64-Bit Server VM (build 25.151-b12, mixed mode)
  : ls: cannot access '/usr/local/java/': No such file or directory

